In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
index = [1, 2, 3]
names = ['First', 'Second', 'third']
s2 = pd.Series(names, index=index)
s2

1     First
2    Second
3     third
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
index = [11, 12, 13]
s2 = pd.Series(names, index=index)
s2

11     First
12    Second
13     third
dtype: object

## Q3: Retrieve First and second elements.

In [4]:
s2[0:2]

11     First
12    Second
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [5]:
# Add elements 
index = [13]
names = ['third']
s3 = pd.Series(names, index=index)
s2 = s2.append(s3)
s2

11     First
12    Second
13     third
13     third
dtype: object

In [7]:
s2=s2.drop_duplicates()
s2

11     First
12    Second
13     third
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [8]:
data = {'ID': [1, 2, 3],
        'Name': ['Sara', 'Reem', 'Nora']}

student = pd.DataFrame(data, columns=['ID', 'Name'])
student

   ID  Name
0   1  Sara
1   2  Reem
2   3  Nora

## Q6: Read educ_figdp_1_Data.csv file

In [9]:
read = pd.read_csv('educ_figdp_1_Data.csv')
read

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [ ]:
#1- slice:  does not use the index labels as references, but the position

In [10]:
read[:3]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e

In [ ]:
#2-loc: access row(s) and column(s) by label

In [11]:
read.loc[90:94, ['TIME', 'GEO']]

    TIME      GEO
90  2006  Belgium
91  2007  Belgium
92  2008  Belgium
93  2009  Belgium
94  2010  Belgium